 # Sprawozdanie 
 Mateusz Lęcznar

Łączenie za pomocą sqlAlchemy

In [1]:
from sqlalchemy import create_engine
import psycopg2 as pg
import pandas as pd

db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

db = create_engine(db_string)

connection_sqlalchemy = db.connect()

1.Ile kategorii filmów mamy w wypożyczalni?

In [2]:
result_set = db.execute("SELECT MAX(category_id) FROM film_category")  
for r in result_set:  
    r=int(r[0])
    print("Liczba kategori filmów   : ",r)

Liczba kategori filmów   :  16

2.Wyświetl listę kategorii w kolejności alfabetycznej.

In [3]:
alphabet_set = db.execute("SELECT name FROM category ORDER BY name") 
for r in alphabet_set:
    print(r[0])

Action
Animation
Children
Classics
Comedy
Documentary
Drama
Family
Foreign
Games
Horror
Music
New
Sci-Fi
Sports
Travel

3.Znajdź najstarszy i najmłodszy film do wypożyczenia.

In [4]:
release_film_min=db.execute('SELECT MIN(release_year)FROM film')
for r in release_film_min:
    print(r[0])
    
release_film_max=db.execute('SELECT MAX(release_year) FROM film')
for r in release_film_max:
    print(r[0])

2006
2006

Wszystkie filmy są z roku 2006

4.Ile wypożyczeń odbyło się między 2005-07-01 a 2005-08-01

In [5]:
rent1=db.execute("SELECT COUNT(rental_date)FROM rental WHERE rental_date BETWEEN '2005-07-01' AND '2005-08-01'")
for r in rent1:
    print(r[0])

6709

5.Ile wypożyczeń odbyło się między 2010-01-01 a 2011-02-01?

In [6]:
rent2=db.execute("SELECT COUNT(rental_date)FROM rental WHERE rental_date BETWEEN '2010-01-01' AND '2011-02-01'")
for r in rent2:
    print(r[0])

0

6.Znajdź największą płatność wypożyczenia.

In [7]:
payment=db.execute("SELECT MAX(amount) FROM payment")
for r in payment:
    print("Najwieksza płatność wypożyczenia to :",r[0])

Najwieksza płatność wypożyczenia to : 11.99

7.Znajdź wszystkich klientów z Polski, Nigerii lub Bangladeszu

In [8]:
clients=db.execute("select country.country ,customer.first_name,customer.last_name,customer.customer_id  from country,city, address, customer where country.country IN ('Poland','Nigeria','Bangladesh') and country.country_id=city.country_id and address.city_id=city.city_id and customer.address_id=address.address_id")

print("KRAJ, IMIE I NAZWISKO, ID_cutomer")
for r in clients:
    print(r[0],r[1],r[2])

KRAJ, IMIE I NAZWISKO, ID_cutomer
Nigeria Sonia Gregory
Poland Brian Wyman
Poland Sidney Burleson
Nigeria Rodney Moeller
Bangladesh Stephen Qualls
Nigeria Velma Lucas
Nigeria Marilyn Ross
Nigeria Elsie Kelley
Nigeria Gladys Hamilton
Bangladesh Frank Waggoner
Poland Marjorie Tucker
Nigeria Carol Garcia
Poland Leah Curtis
Poland Ruben Geary
Nigeria Olga Jimenez
Nigeria Bertha Ferguson
Nigeria Tracey Barrett
Nigeria Jo Fowler
Poland Johnnie Chisholm
Nigeria Wallace Slone
Bangladesh Michelle Clark
Poland Russell Brinson
Poland Jimmie Eggleston
Nigeria Constance Reid

8.Gdzie mieszkają członkowie personelu?

In [9]:
staff=db.execute("SELECT address,city.city,country.country FROM address,staff, city, country where staff.address_id=address.address_id and city.city_id=address.city_id and country.country_id=city.country_id ")
print("Członkowie personelu mieszkają: ")
for r in staff:
    print(r)

Członkowie personelu mieszkają:
('23 Workhaven Lane', 'Lethbridge', 'Canada')
('1411 Lillydale Drive', 'Woodridge', 'Australia')

9.Ilu pracowników mieszka w Argentynie lub Hiszpanii?

In [10]:
argentina=db.execute("SELECT COUNT(staff) FROM address,staff, city, country where staff.address_id=address.address_id and city.city_id=address.city_id and country.country_id=city.country_id and country.country IN ('Spanish','Argentina')")
print("W argentynie albo w hiszpani mieszka osób: ")
for r in argentina:
    print(r[0])

W argentynie albo w hiszpani mieszka osób:
0

10.Jakie kategorie filmów zostały wypożyczone przez klientów?

In [11]:
category= db.execute("SELECT category AS kategorie_filmow_wypozyczane_przez_klientow \
                 FROM sales_by_film_category \
                 WHERE total_sales > 0")

for r in category:
    print(r[0])

Sports
Sci-Fi
Animation
Drama
Comedy
New
Action
Foreign
Games
Family
Documentary
Horror
Classics
Children
Travel
Music

11.Znajdź wszystkie kategorie filmów wypożyczonych w Ameryce.

In [12]:

category1 = db.execute("SELECT distinct category.name AS kategorie_filmow_wypozyczonych_w_Ameryce \
            FROM category, film_category, inventory, rental, customer, address, city, country \
            WHERE category.category_id=film_category.category_id \
            AND film_category.film_id=inventory.film_id \
            AND inventory.inventory_id=rental.inventory_id \
            AND rental.customer_id=customer.customer_id \
            AND customer.address_id=address.address_id \
            AND address.city_id=city.city_id \
            AND city.country_id=country.country_id \
            AND country.country in ('United States')")

for r in category1:
    print(r[0])

Sports
Classics
New
Family
Comedy
Animation
Travel
Music
Drama
Horror
Sci-Fi
Games
Documentary
Foreign
Action
Children

12.Znajdź wszystkie tytuły filmów, w których grał: Olympia Pfeiffer lub Julia Zellweger lub Ellen Presley

In [13]:

titles= db.execute("SELECT film.title, actor.first_name, actor.last_name \
                FROM film \
                INNER JOIN film_actor ON film.film_id=film_actor.film_id \
                INNER JOIN actor ON film_actor.actor_id=actor.actor_id \
                WHERE (actor.first_name = 'Olympia' AND actor.last_name = 'Pfeiffer') \
                OR  (actor.first_name = 'Julia' AND actor.last_name = 'Zellweger') \
                OR  (actor.first_name = 'Ellen' AND actor.last_name = 'Presley')")
print('Wszystkie tytuły filmów w których grali Olympia Pfeiffer')
print('lub Jilia Zellweger lub Ellen Presley')
for r in titles:
    print(r[0])

Wszystkie tytuły filmów w których grali Olympia Pfeiffer
lub Jilia Zellweger lub Ellen Presley
Bilko Anonymous
Caribbean Liberty
Casper Dragonfly
Empire Malkovich
Floats Garden
Frogmen Breaking
Homeward Cider
Hyde Doctor
Image Princess
Jacket Frisco
Microcosmos Paradise
Network Peak
Oscar Gold
Pickup Driving
Pinocchio Simon
Private Drop
Roots Remember
Scarface Bang
Secretary Rouge
Spy Mile
Streetcar Intentions
Tadpole Park
Treasure Command
Turn Star
Women Dorado
Badman Dawn
Chitty Lock
Color Philadelphia
Contact Anonymous
Deep Crusade
Effect Gladiator
Express Lonely
Firehouse Vietnam
Fugitive Maguire
Hanky October
Ice Crossing
Idols Snatchers
Intolerable Intentions
Magnolia Forrester
Mars Roman
Maude Mod
Murder Antitrust
None Spiking
Others Soup
Psycho Shrunk
Santa Paris
Sense Greek
Storm Happiness
Sweet Brotherhood
Titanic Boondock
Tourist Pelican
Traffic Hobbit
Wait Cider
Breakfast Goldfinger
Cranes Reservoir
Dares Pluto
Detective Vision
Divorce Shining
Hollow Jeopardy
Jeopardy Encino
Lambs Cincinatti
Majestic Floats
Minds Truman
Open African
Outlaw Hanky
Panky Submarine
Rider Caddyshack
Won Dares
Wyoming Storm

Łączenie się za pomocą psycopg2 i pandas

In [14]:
import psycopg2 as pg
import pandas as pd

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')
#df = pd.read_sql('select * from film',con=connection)

df=pd.read_sql("SELECT*FROM address",con=connection)
print(df)

     address_id                   address address2      district  city_id  \
0             1         47 MySakila Drive     None       Alberta      300
1             2        28 MySQL Boulevard     None           QLD      576
2             3         23 Workhaven Lane     None       Alberta      300
3             4      1411 Lillydale Drive     None           QLD      576
4             5            1913 Hanoi Way               Nagasaki      463
..          ...                       ...      ...           ...      ...
598         601       844 Bucuresti Place               Liaoning      242
599         602  1101 Bucuresti Boulevard            West Greece      401
600         603    1103 Quilmes Boulevard                  Piura      503
601         604       1331 Usak Boulevard                   Vaud      296
602         605      1325 Fukuyama Street           Heilongjiang      537

    postal_code         phone         last_update
0                             2006-02-15 09:45:30
1                             2006-02-15 09:45:30
2                 14033335568 2006-02-15 09:45:30
3                  6172235589 2006-02-15 09:45:30
4         35200   28303384290 2006-02-15 09:45:30
..          ...           ...                 ...
598       36603  935952366111 2006-02-15 09:45:30
599       97661  199514580428 2006-02-15 09:45:30
600       52137  644021380889 2006-02-15 09:45:30
601       61960  145308717464 2006-02-15 09:45:30
602       27107  288241215394 2006-02-15 09:45:30

[603 rows x 8 columns]

/tmp/ipykernel_9328/2751501613.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df=pd.read_sql("SELECT*FROM address",con=connection)